[
    {
        "thumbnail": "https://poralekha.info/wp-content/uploads/2022/04/ezgif.com-gif-maker-54-1536x865.webp",
        "title": "Higher Studies After HSC? Know the Top 10 Tips and Tricks part2",
        "date": "April 23, 2023",
        "timeRequired": 2,
        "view": "0",
        "category": "Career Guideline",
        "authorName": "poralekha.info",
        "authorImg": "https://firebasestorage.googleapis.com/v0/b/fractos-4a8cb.appspot.com/o/fractos%2FporalekhaAuthor.webp?alt=media&token=3667a39f-63c0-4357-a39d-bd8a58e8026b",
        "detail": "However, this practice is becoming less common nowadays. Most students get freedom choosing a degree and courses. It doesn’t matter from which stream you are from, everything is open for you with some exceptions. <br/><br/>So, get to know yourself, know what you want now, what you want to be in the future, and just go for it without wasting any time."
    },
    {
        "thumbnail": "https://poralekha.info/wp-content/uploads/2022/04/ezgif.com-gif-maker-54-1536x865.webp",
        "title": "Higher Studies After HSC? Know the Top 10 Tips and Tricks part3",
        "date": "April 23, 2023",
        "timeRequired": 2,
        "view": "0",
        "category": "Career Guideline",
        "authorName": "poralekha.info",
        "authorImg": "https://firebasestorage.googleapis.com/v0/b/fractos-4a8cb.appspot.com/o/fractos%2FporalekhaAuthor.webp?alt=media&token=3667a39f-63c0-4357-a39d-bd8a58e8026b",
        "detail": "However, this practice is becoming less common nowadays. Most students get freedom choosing a degree and courses. It doesn’t matter from which stream you are from, everything is open for you with some exceptions. <br/><br/>So, get to know yourself, know what you want now, what you want to be in the future, and just go for it without wasting any time."
    },
    {
        "thumbnail": "https://firebasestorage.googleapis.com/v0/b/fractos-4a8cb.appspot.com/o/fractos%2FnikolaTesla.jpg?alt=media&token=4b48cefc-df58-4a36-bebd-2bf4325becbe",
        "title": "নিকোলা টেসলা, এক ভাগ্যবিড়ম্বিত তড়িৎ জাদুকর!",
        "date": "September 10, 2022",
        "timeRequired": 5,
        "view": "0",
        "category": " বিজ্ঞান ও প্রযুক্তি",
        "authorName": "rokomari.blog",
        "authorImg": "https://firebasestorage.googleapis.com/v0/b/fractos-4a8cb.appspot.com/o/fractos%2FrokomariAuthor.png?alt=media&token=d0b75af4-86e6-4a26-982c-e4b80d81432b",
        "detail": "১৮৭০ সাল। ক্রোয়েশিয়ার এক স্কুলে গণিত ক্লাস চলছে। আজকের বিষয় ইন্টিগ্রেশন। বেশ কটা ক্লাসের পর আজকে কঠিন কঠিন ইন্টিগ্রেশন শুরু। বোর্ডে কতগুলো অঙ্ক লিখে শিক্ষক ফিরলেন ছাত্ররা অঙ্ক করছে কিনা দেখতে। সবাই মনোযোগ দিয়ে করছে। কিন্তু একজন বসেই আছে। স্যার তার দিকে এগিয়ে গেলেন। বললেন, “তুমি করছ না কেন?’ ১৪ বছরের সেই ছেলেটি বোর্ডের সব অঙ্কের উত্তর বলে গেল। স্যার ভাবলেন ছেলেটা হয়তো কোনোভাবে উত্তরগুলো মুখস্থ করে এসেছে। তিনি বানিয়ে কয়েকটি অঙ্ক দিলেন। ছেলেটি এবারও সব অঙ্কের নির্ভুল উত্তর বলে দিল! একবারও খাতা-কলম হাতে নিল না! শিক্ষক মহাশয় বুঝতে পারলেন, এই ছেলে ভয়ংকর মেধাবী। ছেলেটির নাম নিকোলা টেসলা। আজকের IEEE সংগঠনের এক সময়ের ভাইস প্রেসিডেন্ট! টেসলা কি ইউরোপীয়? নাকি আমেরিকান? নিকোলা টেসলার লেখা উল্টেপাল্টে দেখলে আপনার মনে হবে, লোকটি বুঝি কড়া আমেরিকান। তাঁর শেষ দিককার লেখাগুলো পড়লে আপনি কোনোদিন ভাবতেও পারবেন না, এই ভদ্রলোক আদতে একজন ইউরোপীয়। সত্যি বলতে, টেসলার জন্ম অস্ট্রীয় সাম্রাজ্যে, জাতিগত দিক দিয়ে তিনি একজন সার্বিয়ান এবং পরবর্তী জীবনে একজন আমেরিকান। বাবার ইচ্ছে পূরণ হলো না… ১৮৫৬ সালের ১০ জুলাই টেসলার জন্ম, ক্রোয়েশিয়ার এক গ্রামে। বাবা ছিলেন একজন ধর্মযাজক। নানাও ছিলেন তাই। পাঁচ ভাই-বোনের মধ্যে তিনি ছিলেন চতুর্থ। বড় ভাই মারা গিয়েছিলেন ঘোড়া থেকে পড়ে গিয়ে। তাঁর বাবার ইচ্ছে ছিল, নিকোলাও বড় হয়ে যাজক হবেন তাঁর মতো। ছোট থেকেই তাঁকে সেটা নিয়ে চাপ দিতেন। কিন্তু নিকোলা সেটা চাইতেন না, একদমই না। Tesla's home এই বাড়িতেই টেসলার জন্ম চার বছরের পড়া তিন বছরেই শেষ! ১৮৬১ সালে প্রাইমারি স্কুলে ভর্তি হন টেসলা। শেখেন জার্মান ভাষা, গণিত আর ধর্মতত্ত্ব। ১৮৭০ সালে হাইস্কুলে পড়ছিলেন তিনি। একটু আগে বলা সেই ইন্টিগ্রেশনের ঘটনাটি সেখানেই ঘটে। তখনই তাঁর আসল মেধা ধরা পড়ে। চার বছরের পড়া তিন বছরেই শেষ করে গ্র্যাজুয়েট হয়ে গেলেন তিনি ১৮৭৩ সালে। উল্টো বাবাই পূরণ করলেন ছেলের ইচ্ছে সে বছরই টেসলা ফিরে গেলেন নিজের গ্রামে। এসে কলেরার প্রকোপে পড়লেন। খুব ভয়ংকর অবস্থা। নয় মাস ছিলেন শয্যাশায়ী। কয়েকবার মৃত্যুর কাছাকাছি পৌঁছে গিয়েছিলেন। তাঁর বাবা অসহায় হয়ে কথা দিলেন, সুস্থ হলে তাঁকে সবচেয়ে ভালাে ইঞ্জিনিয়ারিং স্কুলে পড়তে পাঠাবেন। আর বলবেন না যাজক হতে। টেসলা সুস্থ হয়ে উঠলেন একসময়। বাবা পরে কথা রেখেছিলেন বটে! ফিকশন পাঠ ভূমিকা রেখেছিল তাঁর আত্মোন্নয়নে ১৮৭৪ সালে টেসলা সেনাবাহিনীতে ভর্তি হওয়া থেকে বাঁচতে পালিয়ে গেলেন। পাহাড়ে পাহাড়ে ঘুরলেন কিছুদিন। টেসলা পরে বলেছিলেন, প্রকৃতির সঙ্গে এই নৈকট্যটা তাঁর বড় দরকার ছিল। বসে বসে মার্ক টোয়েন পড়তেন তিনি। বড় হয়ে টোয়েন সাহেবের সঙ্গে তাঁর দেখাও হয়েছিল। ইঞ্জিনিয়ারিং স্কুলে সব বিষয়ে ছিল সর্বোচ্চ গ্রেড ১৮৭৫ সালে টেসলা ভর্তি হলেন অস্ট্রিয়ান পলিটেকনিকে। ইঞ্জিনিয়ারিং স্কুলে পড়ার স্বপ্ন পূরণ হলাে তাঁর। প্রথম বর্ষে তিনি একটা লেকচারও মিস করেননি। সব বিষয়ে ছিল সর্বোচ্চ গ্রেড। ডিনের কাছ থেকে লেটার পেয়েছিলেন তাঁর বাবা, ‘আপনার ছেলে প্রথম শ্রেণির স্টার।’ প্রতিদিন রাত ৩টা থেকে ১১টা পর্যন্ত টানা খাটতেন। (কিংবা ভিন্ন কোনাে রুটিন। মােদ্দা কথা, বড় একটা সময়।) ছুটির দিনেও বিশ্রাম নিতেন না। ১৮৭৯ সালে বাবা মারা যাওয়ার পর বাবার পুরােনাে চিঠি ঘাঁটতে গিয়ে তিনি দেখলেন, সেখানে তাঁর প্রফেসরদের চিঠি আছে, “আপনার ছেলেকে এখনই স্কুল থেকে সরিয়ে নিন। না হলে খাটতে খাটতে মারাই যাবে।” কিন্তু শেষ পর্যন্ত ড্রপ আউট! দ্বিতীয় বর্ষে ‘ক্যুরেটর দরকার কি দরকার না, সেটা নিয়ে তিনি তর্কে জড়িয়ে পড়েন প্রফেসরের সঙ্গে। সে বছরই জুয়ায় আসক্ত হয়ে পড়েন নিকোলা টেসলা। স্কলারশিপ বাতিল হয়ে যায় তাঁর। তৃতীয় বর্ষে তিনি তাঁর সব সম্পদ জুয়ায় উড়িয়ে নিঃস্ব হয়ে পড়েন। কিন্তু জুয়া খেলেই সব আবার ফেরত আনেন। তাঁর মতাে কোনাে মানুষের জন্য ব্যাপারটা একটু অবিশ্বাস্যই শােনায়। পরে তাঁকে বিলিয়ার্ড খেলার নেশা পেয়ে বসে। পরীক্ষার সময় আসার পর টেসলা আবিষ্কার করেন, তিনি কিছুই পড়েননি। পরীক্ষার আগে তিনি ছুটি বাড়াতে চাইলেন। কিন্তু তাঁর দাবি অগ্রাহ্য করা হলাে। তিনি গ্র্যাজুয়েশন শেষ করতেই পারলেন না। শেষ সেমিস্টারে কোনাে গ্রেডই তাঁর ভাগ্যে জুটল না। হয়ে গেলেন একজন ড্রপআউট!"
    },
    {
        "thumbnail": "https://firebasestorage.googleapis.com/v0/b/fractos-4a8cb.appspot.com/o/fractos%2FwebDev.jpg?alt=media&token=3e0ab7e7-bc1e-43d7-9fd0-971ca5df1488",
        "title": "ওয়েব ডেভেলপমেন্ট এর বেসিক জ্ঞান",
        "date": "September 27, 2021",
        "timeRequired": 3,
        "view": "0",
        "category": " বিজ্ঞান ও প্রযুক্তি",
        "authorName": "rokomari.blog",
        "authorImg": "https://firebasestorage.googleapis.com/v0/b/fractos-4a8cb.appspot.com/o/fractos%2FrokomariAuthor.png?alt=media&token=d0b75af4-86e6-4a26-982c-e4b80d81432b",
        "detail": "Web Development Stack হলো কয়েকটি ওয়েব টেকনোলজি বা টুলস যেমন, বিভিন্ন Programming Language, Framework ও Database Development Technology এর  সমন্বয় যেগুলো ব্যবহার করে পরবর্তীতে ওয়েব এপ্লিকেশন, ওয়েবসাইট বা মোবাইল এপ্লিকেশন ডিজাইন করা যায়। Web Development Stack গুলোকে মোটা দাগে Front-end ও Back-end  দুই ভাগে ভাগ করে ফেলা যায়। আর Front-end, Back-end মিলে যে stack তৈরি হয়  তা হলো একটি Full Stack Web Development । যেকোনো প্রোগ্রাম বা প্রজেক্টের জন্য সঠিক Stack বাছাই করা খুবই গুরুত্বপূর্ণ। কারণ আপনার কোডিং প্রজেক্টটি শুধুমাত্র ডিজাইন করা পর্যন্তই আপনার Web Development Stack সীমিত নয়, সঠিকভাবে Web Development Stack বাছাই করলে আপনি একবারেই আপনার প্রজেক্ট এর ভবিষ্যৎ Scalability এবং Maintenance অনেকটা সহজ করে ফেলতে পারবেন। Front-end  ওয়েব ডেভেলপমেন্ট কী? একটা ওয়েবসাইটের চেহেরা , লেইআউট  বা দেখতে কেমন হবে তা ফ্রন্টএন্ড ডেভেলপাররা ডিজাইন করে থাকে। ওয়েবসাইট ডিজাইন এর  বেশ কিছু টুলস আছে যেমন : Photoshop, Figma, UX/UI Designer, Sketch 3, Adobe XD, InVision Studio, Framer X, Pixelmator  ইত্যাদি। এগুলা ব্যবহার করে একটি ওয়েবসাইট  ডিজাইন করা হয়ে থাকে, ওয়েবসাইট এর ইউজার  ইন্টারফেস  কেমন হবে তা ডিজাইন করা হয়ে থাকে  এবং  এই ডিজাইন কে ওয়েব  পেজ এ রূপান্তর করার জন্য কিছু মার্কাপ ল্যাংগুয়েজ এবং প্রোগ্রামিং  ল্যাংগুয়েজ ব্যবহার  করা হয়ে থাকে । যেমনঃ  , HTML , CSS , Bootstrap, jQuery, Javascript  ইত্যাদি।  এই সমস্ত কিছু  ফ্রন্টএন্ড ডেভেলপার এর আওতায় পড়ে।  ফ্রন্টএন্ড ডেভেলপমেন্ট বলতে আমরা এই সমস্ত কিছুই বুঝে থাকি। Back-end  ওয়েব ডেভেলপমেন্ট কী? ব্যাকএন্ড ওয়েব ডেভেলপমেন্ট, বড়াবড়ি আমার কাছে ফ্রন্টএন্ড এর থেকে  ব্যাকএন্ড ওয়েব ডেভেলপমেন্ট বেশি ভালো লাগে এখানে বেশ কিছু কারণ আছে , আচ্ছা  আপনাদের সাথে তা নিয়ে আলোচনা করা যাক এতে উভয়ের ই লাভ বা জ্ঞান বৃদ্ধি পাবে এবং আমার কিছু মিস্টেক হয়ে থাকলে আপনারা তা আমাকে জানিয়ে দিতে পারেন এতে আমি আমার ভুল বুঝতে পারবো এবং তা ঠিক শিক্ষা নিতে পারবো , তাই পরিশেষে আমাদের সবারই কিন্তু বিষয় টা নিয়ে খুব ভালো ভাবে জানা হয়ে গেলো, তাই কোন কিছু  জানলে তা কারো সাথে শেয়ার করতে দ্বিধা করবেন না ।"
    }
]